borgmarks/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>index</title>
<!-- 2017-07-08 Sat 16:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="merlin" />
</head>
<body>
<div id="content">
<h1 class="title">index</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Borgmarks</a>
<ul>
<li><a href="#sec-1-1">1.1. Theory of organization</a></li>
<li><a href="#sec-1-2">1.2. Theory of operation</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Managing web bookmarks with Org-mode&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class="orgmode">orgmode</span>&#xa0;<span class="bookmarks">bookmarks</span></span></a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Great Talks</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Brian Kernighan - How to succeed at language design without really trying&#xa0;&#xa0;&#xa0;<span class="tag"><span class="talk">talk</span>&#xa0;<span class="kernighan">kernighan</span>&#xa0;<span class="language">language</span>&#xa0;<span class="design">design</span>&#xa0;<span class="awk">awk</span></span></a></li>
<li><a href="#sec-1-3-2">1.3.2. Gerald Sussman - We Don't Really Know how to Compute&#xa0;&#xa0;&#xa0;<span class="tag"><span class="talk">talk</span>&#xa0;<span class="sussman">sussman</span>&#xa0;<span class="computation">computation</span></span></a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. Revision Control</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. Git Book (v2)&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="book">book</span></span></a></li>
<li><a href="#sec-1-4-2">1.4.2. git ready&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="tips">tips</span>&#xa0;<span class="tricks">tricks</span></span></a></li>
<li><a href="#sec-1-4-3">1.4.3. GitAlias/gitalias/gitalias.txt&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="alias">alias</span>&#xa0;<span class="aliases">aliases</span>&#xa0;<span class="tricks">tricks</span></span></a></li>
<li><a href="#sec-1-4-4">1.4.4. Understanding git filter-branch&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="advanced">advanced</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="tricks">tricks</span></span></a></li>
<li><a href="#sec-1-4-5">1.4.5. A successful Git branching model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></a></li>
<li><a href="#sec-1-4-6">1.4.6. Atlassian's comparing workflows and tutorials&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></a></li>
<li><a href="#sec-1-4-7">1.4.7. HGFlow - Generalized Driessen's Branching Model&#xa0;&#xa0;&#xa0;<span class="tag"><span class="hg">hg</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></a></li>
<li><a href="#sec-1-4-8">1.4.8. Understanding the Github Flow&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="github">github</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></a></li>
<li><a href="#sec-1-4-9">1.4.9. tig&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="porcelain">porcelain</span>&#xa0;<span class="curses">curses</span></span></a></li>
<li><a href="#sec-1-4-10">1.4.10. Magit&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="porcelain">porcelain</span>&#xa0;<span class="emacs">emacs</span></span></a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. Uncategorized</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Borgmarks</h2>
<div class="outline-text-2" id="text-1">
<p>
Bookmarks in emacs org-mode.
</p>

<p>
Curated, categorized, and tagged by hand.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Theory of organization</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Primary categories are used for bucketing related ideas.
</p>

<p>
Tagging is used for exposing topics related to a particular link.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Theory of operation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Links should be their own headings followed by tags.
Optional properties with CREATED date.
Description.
</p>
</div>

<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> <a href="http://karl-voit.at/2014/08/10/bookmarks-with-orgmode/">Managing web bookmarks with Org-mode</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class="orgmode">orgmode</span>&#xa0;<span class="bookmarks">bookmarks</span></span></h4>
<div class="outline-text-4" id="text-1-2-1">

<p>
Well written post linked to from <a href="https://www.reddit.com/r/orgmode/comments/3vtxz1/storing_a_collection_of_web_bookmarks_with_org/">this discussion on reddit</a> and elsewhere.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq org-capture-templates
  '(
    ;; many more capture templates
    ("b" "Bookmark" entry (file+headline "~/share/all/org-mode/notes.org" "Bookmarks") "* %?\n:PROPERTIES:\n:CREATED: %U\n:END:\n\n" :empty-lines 1)
    ;; many more capture templates
   )
)
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Great Talks</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> <a href="https://www.youtube.com/watch?v=Sg4U4r_AgJU">Brian Kernighan - How to succeed at language design without really trying</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="talk">talk</span>&#xa0;<span class="kernighan">kernighan</span>&#xa0;<span class="language">language</span>&#xa0;<span class="design">design</span>&#xa0;<span class="awk">awk</span></span></h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
Mentions Alan Perlis' <a href="http://www.cs.yale.edu/homes/perlis-alan/quotes.html">Epigrams in Programming</a>
</p>
</div>
</div>

<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> <a href="https://www.youtube.com/watch?v=O3tVctB_VSU">Gerald Sussman - We Don't Really Know how to Compute</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="talk">talk</span>&#xa0;<span class="sussman">sussman</span>&#xa0;<span class="computation">computation</span></span></h4>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Revision Control</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> <a href="https://git-scm.com/book/en/v2">Git Book (v2)</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="book">book</span></span></h4>
</div>

<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> <a href="http://gitready.com/">git ready</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="tips">tips</span>&#xa0;<span class="tricks">tricks</span></span></h4>
</div>

<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> <a href="https://github.com/GitAlias/gitalias/blob/master/gitalias.txt">GitAlias/gitalias/gitalias.txt</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="alias">alias</span>&#xa0;<span class="aliases">aliases</span>&#xa0;<span class="tricks">tricks</span></span></h4>
</div>

<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> <a href="http://manishearth.github.io/blog/2017/03/05/understanding-git-filter-branch/">Understanding git filter-branch</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="advanced">advanced</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="tricks">tricks</span></span></h4>
</div>

<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> <a href="http://nvie.com/posts/a-successful-git-branching-model/">A successful Git branching model</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></h4>
<div class="outline-text-4" id="text-1-4-5">
<p>
Original post from 2010.  Also check out <a href="https://github.com/nvie/gitflow">Van Driessen's git flow plugin</a>.
</p>
</div>
</div>

<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> <a href="https://www.atlassian.com/git/tutorials/comparing-workflows">Atlassian's comparing workflows and tutorials</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></h4>
</div>

<div id="outline-container-sec-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> <a href="https://bitbucket.org/yujiewu/hgflow/wiki/Home.wiki#!generalized-driessens-branching-model">HGFlow - Generalized Driessen's Branching Model</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="hg">hg</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></h4>
</div>

<div id="outline-container-sec-1-4-8" class="outline-4">
<h4 id="sec-1-4-8"><span class="section-number-4">1.4.8</span> <a href="https://guides.github.com/introduction/flow/">Understanding the Github Flow</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="github">github</span>&#xa0;<span class="workflow">workflow</span>&#xa0;<span class="branch">branch</span>&#xa0;<span class="model">model</span></span></h4>
</div>

<div id="outline-container-sec-1-4-9" class="outline-4">
<h4 id="sec-1-4-9"><span class="section-number-4">1.4.9</span> <a href="https://github.com/jonas/tig">tig</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="porcelain">porcelain</span>&#xa0;<span class="curses">curses</span></span></h4>
</div>

<div id="outline-container-sec-1-4-10" class="outline-4">
<h4 id="sec-1-4-10"><span class="section-number-4">1.4.10</span> <a href="https://magit.vc/">Magit</a>&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span>&#xa0;<span class="porcelain">porcelain</span>&#xa0;<span class="emacs">emacs</span></span></h4>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Uncategorized</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: merlin</p>
<p class="date">Created: 2017-07-08 Sat 16:14</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
